site/docs/v1/tech/guides/user-actions-new.md
```mermaid
sequenceDiagram
    participant U as User
    participant PP as PiedPiper
    participant FA as FusionAuth
    participant I as Intercom
    participant S as Slack

    U->>PP: Pay for a month subscription
    PP->>FA: Apply subscription Action
    FA->>U: Send welcome email
    FA->>I: Send subscription notification

    break One month passes
        U-->PP: Subscription expires
    end

    FA->>U: Send goodbye email
    FA->>PP: Send expiry notification
    PP->>FA: Apply preventLogin Action

    U->>PP: Complete customer survey form
    PP->>FA: Apply survey Action
    FA->>S: Send survey notification
    PP->>FA: Retrieve all Actions for the User
```
